In [1]:
import numpy as np

In [2]:
import  pandas as pd

In [3]:
sozluk={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],"Spor":["Koşu" ,"Yüzme","Koşu","Basketbol"]
       ,"Kalori":[100,200,300,400]}

In [5]:
dataFrame1=pd.DataFrame(sozluk,index=[0,1,2,3])

In [6]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atil  Basketbol     400

In [7]:
sozluk1={"Isim":["Osman","Leven","Atlas","Fatme"],
        "Spor":["Koşu" ,"Yüzme","Koşu","Basketbol"]
       ,"Kalori":[200,150,50,500]}

In [8]:
dataFrame2=pd.DataFrame(sozluk1,index=[4,5,6,7])

In [9]:
dataFrame2

    Isim       Spor  Kalori
4  Osman       Koşu     200
5  Leven      Yüzme     150
6  Atlas       Koşu      50
7  Fatme  Basketbol     500

In [10]:
sozluk2={"Isim":["Cagatay","Veli","Batu","Burak"],
        "Spor":["Koşu" ,"Yüzme","Badminton","Tenis"]
       ,"Kalori":[200,150,500,50]}

In [11]:
DataFrame3=pd.DataFrame(sozluk2,index=[8,9,10,11])

In [12]:
DataFrame3

       Isim       Spor  Kalori
8   Cagatay       Koşu     200
9      Veli      Yüzme     150
10     Batu  Badminton     500
11    Burak      Tenis      50

##concatenation

In [18]:
pd.concat([dataFrame1,dataFrame2,DataFrame3])

       Isim       Spor  Kalori
0     Ahmet       Koşu     100
1    Mehmet      Yüzme     200
2    Zeynep       Koşu     300
3      Atil  Basketbol     400
4     Osman       Koşu     200
5     Leven      Yüzme     150
6     Atlas       Koşu      50
7     Fatme  Basketbol     500
8   Cagatay       Koşu     200
9      Veli      Yüzme     150
10     Batu  Badminton     500
11    Burak      Tenis      50

##merge

In [25]:
mergeSozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
             "Spor":["Koşu","Yüzme","Koşu","Basketbol"]}

In [26]:
mDataFrame1=pd.DataFrame(mergeSozluk1)

In [27]:
mDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atil  Basketbol

In [31]:
mergeSozluk2={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
             "Kalori":[100,200,150,250]}

In [32]:
mDataFrame2=pd.DataFrame(mergeSozluk2)

In [33]:
mDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atil     250

In [35]:
pd.merge(mDataFrame1,mDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atil  Basketbol     250